{"name": "ECE 101", "ptag": "\nPrinciples and processes for the development of information technologies: digital music, digital images, digital logic, data compression, error correction, information security, and communication networks. Laboratory for design of hardware and software, and experiments in audio and image processing. Intended for students outside the College of Engineering. Credit is not given to Computer or Electrical Engineering majors.This course satisfies the General Education Criteria for:Nat Sci & Tech - Phys SciencesQuantitative Reasoning II"},
{"name": "ECE 110", "ptag": "\nIntroduction to selected fundamental concepts and principles in electrical engineering. Emphasis on measurement, modeling, and analysis of circuits and electronics while introducing numerous applications. Includes sub-discipline topics of electrical and computer engineering, for example, electromagnetics, control, signal processing, microelectronics, communications, and scientific computing basics. Lab work incorporates sensors and motors into an autonomous moving vehicle, designed and constructed to perform tasks jointly determined by the instructors and students.\n"},
{"name": "ECE 120", "ptag": "\nIntroduction to digital logic, computer systems, and computer languages. Topics include representation of information, combinational and sequential logic analysis and design, finite state machines, the von Neumann model, basic computer organization, and machine language programming. Laboratory assignments provide hands-on experience with design, simulation, implementation, and programming of digital systems. Prerequisite: Restricted to Computer Engineering or Electrical Engineering majors or transfer students with ECE Department consent.\n"},
{"name": "ECE 198", "ptag": "\nLectures and discussions relating to new areas of interest. May be repeated in the same or separate terms for unlimited hours if topics vary. See class schedule for topics and prerequisites.\n"},
{"name": "ECE 199", "ptag": "\nApproved for both letter and S/U grading. May be repeated.\n"},
{"name": "ECE 200", "ptag": "\nDiscussions of educational programs, career opportunities, and other topics in electrical and computer engineering. Approved for Letter and S/U grading. May be repeated. For Computer Engineering and Electrical Engineering majors only.\n"},
{"name": "ECE 205", "ptag": "\nECE 205 is an introductory course on circuit analysis and electronics for non-majors in engineering. The course includes bi-weekly electronics lab experiments designed to provide students with hands-on experience. Basic principles of circuit analysis and DC circuits; time-domain analysis of 1st and 2nd order linear circuits; complex numbers, phasors, AC steady-state analysis; frequency response; op-amp, diode, and BJT circuits; logic gates and digital logic circuits. Credit is not given to Computer or Electrical Engineering majors. Credit is not given to Computer or Electrical Engineering majors. Prerequisite: PHYS 212.\n"},
{"name": "ECE 206", "ptag": "\nLaboratory experiments in digital logic and controllers; transistor amplifier and switching circuits; DC motor control and voltage regulators; sensors and motion control with feedback; wireless communication. Credit is not given to Computer or Electrical Engineering majors. Prerequisite: ECE 205.\n"},
{"name": "ECE 210", "ptag": "\nAnalog signal processing, with an emphasis on underlying concepts from circuit and system analysis: linear systems; review of elementary circuit analysis; differential equation models of linear circuits and systems; Laplace transform; convolution; stability; phasors; frequency response; Fourier series; Fourier transform; active filters; AM radio. Credit is not given for both ECE 210 and ECE 211. Prerequisite: ECE 110 and PHYS 212; credit or concurrent registration in MATH 285 or MATH 286.\n"},
{"name": "ECE 211", "ptag": "\nConcepts from circuit and system analysis: linear systems; review of elementary circuit analysis; op amps; transient analysis; differential equation models of linear circuits and systems; Laplace transform. Credit is not given for both ECE 211 and ECE 210. Prerequisite: ECE 110 and PHYS 212; credit or concurrent registration in MATH 285 or MATH 286.\n"},
{"name": "ECE 220", "ptag": "\nAdvanced use of LC-3 assembly language for I/O and function calling convention. C programming, covering basic programming concepts, functions, arrays, pointers, I/O, recursion, simple data structures, linked lists, dynamic memory management, and basic algorithms. Information hiding and object-oriented design as commonly implemented in modern software and computer systems programming. Prerequisite: ECE 120. Restricted to Computer Engineering or Electrical Engineering majors or transfer students with ECE Department consent.\n"},
{"name": "ECE 297", "ptag": "\nIndividual projects. Approved written application to department as specified by department or instructors is required. Approved for both letter and S/U grading. May be repeated in separate terms to a maximum of 2 hours. Prerequisite: Consent of instructor.\n"},
{"name": "ECE 298", "ptag": "\nLectures and discussions relating to new areas of interest. May be repeated in the same or separate terms for unlimited hours if topics vary. See class schedule for topics and prerequisites.\n"},
{"name": "ECE 304", "ptag": "\nIntroduction to active and passive photonic devices and applications; optical processes in semiconductor and dielectric materials including electrical junctions, light emission and absorption, and waveguide confinement; photonic components such as light emitting diodes, lasers, photodetectors, solar cells, liquid crystals, and optical fiber; optical information distribution networks and display applications. Prerequisite: PHYS 214.\n"},
{"name": "ECE 307", "ptag": "\nModeling of decisions in engineering work and the analysis of models to develop a systematic approach to making decisions. Fundamental concepts in linear and dynamic programming; probability theory; and statistics. Resource allocation; logistics; scheduling; sequential decision making; siting of facilities; investment decisions; application of financial derivatives; other problems for decision making under uncertainty. Case studies from actual industrial applications illustrate real-world decisions. Prerequisite: ECE 210; credit or concurrent registration in ECE 313.\n"},
{"name": "ECE 310", "ptag": "\nIntroduction to discrete-time systems and discrete-time signal processing with an emphasis on causal systems; discrete-time linear systems, difference equations, z-transforms, discrete convolution, stability, discrete-time Fourier transforms, analog-to-digital and digital-to-analog conversion, digital filter design, discrete Fourier transforms, fast Fourier transforms, spectral analysis, and applications of digital signal processing. Prerequisite: ECE 210.\n"},
{"name": "ECE 311", "ptag": "\nCompanion laboratory for ECE 310. Prerequisite: Credit or concurrent registration in ECE 310.\n"},
{"name": "ECE 313", "ptag": "\nProbability theory with applications to engineering problems such as the reliability of circuits and systems to statistical methods for hypothesis testing, decision making under uncertainty, and parameter estimation. Same as MATH 362. Credit is not given for both ECE 313 and MATH 461. Prerequisite: MATH 286 or MATH 415.\n"},
{"name": "ECE 314", "ptag": "\nDesigned to be taken concurrently with ECE 313, Probability in Engineering Systems, to strengthen the students' understanding of the concepts in ECE 313 and their applications, through computer simulation and computation using the Python programming language. Topics include sequential hypothesis testing, parameter estimation, confidence intervals, Bloom filters, min hashing, load balancing, inference for Markov chains, PageRank algorithm, vector Gaussian distribution, contagion in networks, principle component method and linear regression for data analysis, investment portfolio analysis. Prerequisite: Concurrent enrollment in ECE 313 or credit in one of: ECE 313, IE 300, STAT 410.\n"},
{"name": "ECE 316", "ptag": "\nEthical issues in the practice of engineering: safety and liability, professional responsibility to clients and employers, whistle-blowing, codes of ethics, career choice, and legal obligations. Philosophical analysis of normative ethical theories. Case studies. Same as PHIL 316. Credit is not given for both ECE 316 and CS 210. Junior standing is required. Prerequisite: RHET 105.This course satisfies the General Education Criteria for:Advanced CompositionHumanities - Hist & Phil"},
{"name": "ECE 317", "ptag": "\nBasic understanding of electrical and computer engineering concepts applicable to technology management. Circuit components; dc fundamentals; ac fundamentals; semiconductors; operational amplifiers; device fabrication; power distribution; digital devices; computer architecture (including microprocessors). Intended for the Business Majors in the Technology and Management program. Credit is not given to Computer or Electrical Engineering majors. Prerequisite: One of MATH 220, MATH 221, MATH 234.\n"},
{"name": "ECE 329", "ptag": "\nElectromagnetic fields and waves fundamentals and their engineering applications: static electric and magnetic fields; energy storage; Maxwell's equations for time-varying fields; wave solutions in free space, dielectrics and conducting media, transmission line systems; time- and frequency-domain analysis of transmission line circuits and Smith chart applications. Prerequisite: ECE 210.\n"},
{"name": "ECE 330", "ptag": "\nNetwork equivalents; power and energy fundamentals, resonance, mutual inductance; three-phase power concepts, forces and torques of electric origin in electromagnetic and electrostatic systems; energy conversion cycles; principles of electric machines; transducers; relays; laboratory demonstration. Prerequisite: ECE 210.\n"},
{"name": "ECE 333", "ptag": "\nElectric power grid structure and policy; analysis of wind, solar, and fuels as raw resources; wind turbines and parks; solar cells, modules, arrays and systems; fuel cell power plants; energy and financial performance of green energy projects; integration of green energy into power grid; energy project report and presentation. Prerequisite: ECE 205 or ECE 210.\n"},
{"name": "ECE 340", "ptag": "\nModern device electronics: semiconductor fundamentals including crystals and energy bands, charge carriers (electrons and holes), doping, and transport, (drift and diffusion); unipolar devices with the MOS field effect transistor as a logic device and circuit considerations; basic concepts of generation-recombination and the P-N junction as capacitors and current rectifier with applications in photonics; bipolar transistors as amplifiers and switching three-terminal devices. Prerequisite: ECE 210; PHYS 214; credit or concurrent registration in ECE 329.\n"},
{"name": "ECE 342", "ptag": "\nAnalysis and design of analog and digital electronic circuits using MOS field effect transistors and bipolar junction transistors, with emphasis on amplifiers in integrated circuits. Credit is not given for both ECE 342 and PHYS 404. Prerequisite: ECE 210.\n"},
{"name": "ECE 343", "ptag": "\nCompanion laboratory for ECE 342. Credit is not given for both ECE 343 and PHYS 404. Prerequisite: Credit or concurrent registration in ECE 342.\n"},
{"name": "ECE 345", "ptag": "\nStudents identify a suitable project, build a team, and explore the feasibility and potential solution space for the selected project area. The intellectual structure of the engineering design process is studied in detail in order to encapsulate the ideation and problem identification aspects of engineering senior design and facilitate student innovation. Same as TE 345. May be repeated in separate terms to a maximum of 4 hours.\n"},
{"name": "ECE 350", "ptag": "\nContinuation of ECE 329: radiation theory; antennas, radiation fields, radiation resistance and gain; transmitting arrays; plane-wave approximation of radiation fields; plane-wave propagation, reflection, and transmission; Doppler effect, evanescent waves and tunneling, dispersion, phase and group velocities; waveguides and resonant cavities; antenna reception and link budgets. Prerequisite: ECE 329.\n"},
{"name": "ECE 365", "ptag": "\nProject-based course focused on exploring and understanding how data are collected, represented and stored, and computed/analyzed upon to arrive at appropriate and meaningful interpretation. Foundations of machine learning are developed and then applied in the context of two specific application areas, such as social network analytics, biological data analysis, and auto and video analytics. Prerequisite: ECE 313.\n"},
{"name": "ECE 374", "ptag": "\nSame as CS 374. See CS 374.\n"},
{"name": "ECE 380", "ptag": "\nPhysics and engineering principles associated with x-ray, computed tomography, nuclear, ultrasound, magnetic resonance, and optical imaging, including human visualization and perception of image data. Same as BIOE 380. Prerequisite: MATH 285 or MATH 286.\n"},
{"name": "ECE 385", "ptag": "\nDesign, build, and test digital systems using transistor-transistor logic (TTL), SystemVerilog, and field-programmable gate arrays (FPGAs). Topics include combinational and sequential logic, storage elements, input/output and display, timing analysis, design tradeoffs, synchronous and asynchronous design methods, datapath and controller, microprocessor design, software/hardware co-design, and system-on-a-chip. Prerequisite: ECE 110 and ECE 220.\n"},
{"name": "ECE 391", "ptag": "\nConcepts and abstractions central to the development of modern computing systems, with an emphasis on the systems software that controls interaction between devices and other hardware and application programs. Input-output semantics; synchronization; interrupts; multitasking; virtualization of abstractions. Term-based projects. Credit is not given for both ECE 391 and CS 241. Prerequisite: ECE 220 or CS 233.\n"},
{"name": "ECE 395", "ptag": "\nPlanning, designing, executing, and documenting a microcomputer-based project. Emphasis on hardware but special projects may require an equal emphasis on software. May be repeated in separate terms. Prerequisite: ECE 385.\n"},
{"name": "ECE 396", "ptag": "\nSpecial project or reading course for James Scholars in engineering. May be repeated. Prerequisite: Consent of instructor.\n"},
{"name": "ECE 397", "ptag": "\nIndividual Projects. Approved for both letter and S/U grading. May be repeated. Prerequisite: Consent of instructor. Approved written application to department as specified by department or instructor is required.\n"},
{"name": "ECE 398", "ptag": "\nSubject offerings of new and developing areas of knowledge in electrical and computer engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. Approved for both letter and S/U grading. May be repeated in the same or separate terms if topics vary.\n"},
{"name": "ECE 399", "ptag": "\nSpecial lecture sequences or discussion groups arranged each term to bring James Scholars in engineering into direct contact with the various aspects of engineering practices and philosophy. For Computer Engineering and Electrical Engineering majors with senior standing. Prerequisite: Consent of instructor.\n"},
{"name": "ECE 401", "ptag": "\nAn introduction to signal analysis and processing methods for advanced undergraduates or graduate students in the biological, physical, social, engineering and computer sciences. Signal analysis methods and their capabilities, weaknesses, and artifacts with an emphasis on their practical application. Significant hands-on processing and interpretation of real data using MATLAB. 4 undergraduate hours. 4 graduate hours. Credit is not given for both ECE 310 and ECE 401. Prerequisite: MATH 220.\n"},
{"name": "ECE 402", "ptag": "\nHistorical survey of electronic and computer music technology; parameters of musical expression and their codification; analysis and synthesis of fixed sound spectra; time-variant spectrum analysis/synthesis of musical sounds; algorithms for dynamic sound synthesis. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 310.\n"},
{"name": "ECE 403", "ptag": "\nResonance and wave phenomena; Acoustics of rooms and transmission lines (e.g., horns); How loudspeakers work: A lab component has been added to measure and model real loudspeakers and enclosures; Topics in digital audio, including AD and DA (Sigma-Delta) audio converters. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 210 and ECE 310.\n"},
{"name": "ECE 408", "ptag": "\nParallel programming with emphasis on developing applications for processors with many computation cores. Computational thinking, forms of parallelism, programming models, mapping computations to parallel hardware, efficient data structures, paradigms for efficient parallel algorithms, and application case studies. Same as CS 483 and CSE 408. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 220.\n"},
{"name": "ECE 411", "ptag": "\nBasic computer organization and design: integer and floating-point computer arithmetic; control unit design; pipelining; system interconnect; memory organization; I/O design; reliability and performance evaluation. Laboratory for computer design implementation, simulation, and layout. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 391 or CS 241.\n"},
{"name": "ECE 412", "ptag": "\nDesign, construction, and use of a small general-purpose computer with a micro-processor CPU; MSI and LSI circuits used extensively; control panel, peripheral controllers, control logic, central processor, and programming experiments. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 385; ECE 391 or CS 233. Recommended: Credit or concurrent registration in ECE 411.\n"},
{"name": "ECE 414", "ptag": "\nSame as BIOE 414. See BIOE 414.\n"},
{"name": "ECE 415", "ptag": "\nSame as BIOE 415. See BIOE 415.\n"},
{"name": "ECE 416", "ptag": "\nUnderlying engineering principles used to detect small molecules, DNA, proteins, and cells in the context of applications in diagnostic testing, pharmaceutical research, and environmental monitoring. Biosensor approaches including electrochemistry, fluorescence, acoustics, and optics; aspects of selective surface chemistry including methods for biomolecule attachment to transducer surfaces; characterization of bisensor performance; blood glucose detection; fluorescent DNA microarrays; label-free biochips; bead-based assay methods. Case studies and analysis of commercial biosensor. Same as BIOE 416. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 329.\n"},
{"name": "ECE 417", "ptag": "\nCharacteristics of speech and image signals; important analysis and synthesis tools for multimedia signal processing including subspace methods, Bayesian networks, hidden Markov models, and factor graphs; applications to biometrics (person identification), human-computer interaction (face and gesture recognition and synthesis), and audio-visual databases (indexing and retrieval). Emphasis on a set of MATLAB machine problems providing hands-on experience. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 310 and ECE 313.\n"},
{"name": "ECE 418", "ptag": "\nConcepts and applications in image and video processing; introduction to multidimensional signal processing: sampling, Fourier transform, filtering, interpolation, and decimation; human visual perception; scanning and display of images and video; image enhancement, restoration and segmentation; digital image and video compression; image analysis. Laboratory exercises promote experience with topics and development of C and MATLAB programs. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 310; credit or concurrent registration in one of ECE 313, STAT 400, IE 300, MATH 461; MATH 415; experience with C programming language.\n"},
{"name": "ECE 419", "ptag": "\nSame as CS 460. See CS 460.\n"},
{"name": "ECE 420", "ptag": "\nDevelopment of real-time digital signal processing (DSP) systems using a DSP microprocessor; several structured laboratory exercises, such as sampling and digital filtering; followed by an extensive DSP project of the student's choice. 2 undergraduate hours. 2 graduate hours. Prerequisite: ECE 310.\n"},
{"name": "ECE 422", "ptag": "\nSame as CS 461. See CS 461.\n"},
{"name": "ECE 424", "ptag": "\nSame as CS 463. See CS 463.\n"},
{"name": "ECE 425", "ptag": "\nComplementary Metal-Oxide Semiconductor (CMOS) technology and theory; CMOS circuit and logic design; layout rules and techniques; circuit characterization and performance estimation; CMOS subsystem design; Very-Large-Scale Integrated (VLSI) systems design methods; VLSI Computer Aided Design (CAD) tools; workstation-based custom VLSI chip design using concepts of cell hierarchy; final project involving specification, design, and evaluation of a VLSI chip or VLSI CAD program; written report and oral presentation on the final project. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 385 and ECE 411; or CS 233.\n"},
{"name": "ECE 428", "ptag": "\nSame as CS 425. See CS 425.\n"},
{"name": "ECE 431", "ptag": "\nTheory and laboratory experimentation with three-phase power, power-factor correction, single- and three-phase transformers, induction machines, DC machines, and synchronous machines; project work on energy control systems; digital simulation of machine dynamics. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 330.\n"},
{"name": "ECE 432", "ptag": "\nAdvanced rotating machine theory and practice: dynamic analysis of machines using reference frame transformations; tests for parameter determination; reduced order modeling of machines; mechanical subsystems including governors, prime movers and excitation systems; digital simulation of inter-connected machines. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 431.\n"},
{"name": "ECE 435", "ptag": "\nSame as CS 436. See CS 436.\n"},
{"name": "ECE 437", "ptag": "\nHands-on exposure to fundamental technology and practical application of sensors. Capacitive, inductive, optical, electromagnetic, and other sensing methods are examined. Instrumentation techniques incorporating computer control, sampling, and data collection and analysis are reviewed in the context of real-world scenarios. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 329.\n"},
{"name": "ECE 438", "ptag": "\nSame as CS 438. See CS 438.\n"},
{"name": "ECE 439", "ptag": "\nOverview of wireless network architectures including cellular networks, local area networks, multi-hop wireless networks such as ad hoc networks, mesh networks, and sensor networks; capacity of wireless networks; medium access control, routing protocols, and transport protocols for wireless networks; mechanisms to improve performance and security in wireless networks; energy-efficient protocols for sensor networks. Same as CS 439. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 241 or ECE 391; one of MATH 461, MATH 463, ECE 313.\n"},
{"name": "ECE 441", "ptag": "\nAdvanced concepts including generation-recombination, hot electron effects, and breakdown mechanisms; essential features of small ac characteristics, switching and transient behavior of p-n junctions, and bipolar and MOS transistors; fundamental issues for device modeling; perspective and limitations of Si-devices. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 340.\n"},
{"name": "ECE 443", "ptag": "\nThis course explores the energy conversion devices from fundamentals to system-levels including electronic structure of semiconductors; quantum physics; compound semiconductors; semiconductor heterostructures and low dimensional quantum structures; energy transfer between photons and electron-hole pairs; photon emission and capture processes; radiative and non-radiative processes; light extraction and trapping; emission and absorption engineering; electrical and optical modelling via numerical and TCAD simulation tools; hands-on characterization of modern light emitting diodes and solar cells. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 340.\n"},
{"name": "ECE 444", "ptag": "\nFabrication lab emphasizing physical theory and design of devices suitable for integrated circuitry; electrical properties of semiconductors and techniques (epitaxial growth, oxidation, photolithography diffusion, ion implantation, metallization, and characterization) for fabricating integrated circuit devices such as p-n junction diodes, bipolar transistors, and field effect transistors. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 340.\n"},
{"name": "ECE 445", "ptag": "\nIndividual design projects in various areas of electrical and computer engineering; projects are chosen by students with approval of instructor. A professionally kept lab notebook, a written report, prepared to journal publication standards, and an oral presentation required. 4 undergraduate hours. No graduate credit. This course satisfies the General Education Criteria for:Advanced Composition"},
{"name": "ECE 446", "ptag": "\nInterdisciplinary approach to learning principles of experimental research. Focuses on: 1) experimental design 2) prevalent experimental techniques 3) data organization, analysis, and presentation and 4) scientific computing. Presentation methods explored include poster session, conference talk, and journal paper. Open-ended labs and a project reinforce concepts discussed in class. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 313.\n"},
{"name": "ECE 447", "ptag": "\nMicrowave circuit design of amplifiers, oscillators, and mixers. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 350 and ECE 453.\n"},
{"name": "ECE 448", "ptag": "\nSame as CS 440. See CS 440.\n"},
{"name": "ECE 449", "ptag": "\nSame as CS 446. See CS 446.\n"},
{"name": "ECE 451", "ptag": "\nManual- and computer-controlled laboratory analysis of circuits at microwave frequencies. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 350.\n"},
{"name": "ECE 452", "ptag": "\nPlane waves at oblique incidence; wave polarization; anisotropic media; radiation; space communications; waveguides. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 350.\n"},
{"name": "ECE 453", "ptag": "\nDesign of a radio system for transmission of information; modulation, receivers, impedance matching, oscillators, two-port network analysis, receiver and antenna noise, nonlinear effects, mixers, phase-locked loops. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 329, credit or concurrent registration in ECE 342.\n"},
{"name": "ECE 454", "ptag": "\nAntenna parameters; polarization of electromagnetic waves; basic antenna types; antenna arrays; broadband antenna design; antenna measurements. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 350.\n"},
{"name": "ECE 455", "ptag": "\nOptical beams and cavities; semiclassical theory of gain; characteristics of typical lasers (gas, solid state, and semiconductor); application of optical devices. 3 undergraduate hours. 4 graduate hours. Prerequisite: ECE 350 or PHYS 436.\n"},
{"name": "ECE 456", "ptag": "\nEngineering aspects of space-based navigation systems, such as the Global Positioning System (GPS). Engineering and physical principles on which GPS operates, including orbital dynamics, electromagnetic wave propagation in a plasma, signal encoding, receiver design, error analysis, and numerical methods for obtaining a navigation solution. GPS as a case study for performing an end-to-end analysis of a complex engineering system. Laboratory exercises focus on understanding receiver design and developing a MATLAB-based GPS receiver. Same as AE 456. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 329 and ECE 310 or AE 352 and AE 353.\n"},
{"name": "ECE 457", "ptag": "\nElectromagnetic wave propagation, microwave transmission systems, passive components, microwave tubes, solid state microwave devices, microwave integrated circuits, S-parameter analysis, and microstrip transmission lines. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 340 and ECE 350.\n"},
{"name": "ECE 458", "ptag": "\nTerrestrial atmosphere, radio wave propagation, and applications to radio sensing and radio communication. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 350.\n"},
{"name": "ECE 459", "ptag": "\nAnalog underpinning of analog and digital communication systems: representation of signals and systems in the time and frequency domains; analog modulation schemes; random processes; prediction and noise analysis using random processes; noise sensitivity and bandwidth requirements of modulation schemes. Brief introduction to digital communications. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 313.\n"},
{"name": "ECE 460", "ptag": "\nScalar fields, geometrical optics, wave optics, Gaussian beams, Fourier optics, spatial and temporal coherence, microscopy, interference chromatic and geometric aberrations, Jones matrices, waveplates, electromagnetic fields, and electro-optic and acousto-optic effects. Laboratory covers numerical signal processing, spectroscopy, ray optics, diffraction, Fourier optics, microscopy, spatial coherence, temporal coherence, polarimetry, fiber optics, electro-optic modulation and acousto-optic modulation. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 329; credit or concurrent registration in ECE 313.\n"},
{"name": "ECE 461", "ptag": "\nReliable communication of one bit of information over three types of channels: additive Gaussian noise, wireline, and wireless. Emphasis on the impact of bandwidth and power on the data rate and reliability, using discrete-time models. Technological examples used as case studies. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 210 and ECE 313.\n"},
{"name": "ECE 462", "ptag": "\nUnate function theory, unate recursive paradigm, synthesis of two-level logic, synthesis of incompletely specified combinational logic, multi-level logic synthesis, binary decision diagrams, finite state machine synthesis, automatic test pattern generation and design for test, equivalence checking and reachability analysis of finite machines, and technology mapping. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 220 or CS 233.\n"},
{"name": "ECE 463", "ptag": "\nHands-on experience in the configuration and performance evaluation of digital communication systems employing both radio and optical signals. 2 undergraduate hours. 2 graduate hours. Prerequisite: ECE 361 or ECE 459.\n"},
{"name": "ECE 464", "ptag": "\nSwitching functions and methods of control such as pulse-width modulation, phase control, and phase modulation; dc-dc, ac-dc, dc-ac, and ac-ac power converters; power components, including magnetic components and power semiconductor switching devices. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 342.\n"},
{"name": "ECE 465", "ptag": "\nFundamentals of lightwave systems: characterization of lightwave channels, optical transmitters, receivers, and amplifiers; quantum and thermal noise processes; design of optical receivers; multimode and single-mode link analysis. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 313 and ECE 350. Recommended: credit or concurrent registration in ECE 459 and ECE 466.\n"},
{"name": "ECE 466", "ptag": "\nFiber components and measurements, transmitters and detectors, fiber amplifiers, multimode fiber links, and wavelength division multiplexing. 1 undergraduate hour. 1 graduate hour. Prerequisite: Credit or concurrent registration in ECE 465.\n"},
{"name": "ECE 467", "ptag": "\nOverview of the field of biophotonics, in three segments: (1) fundamental principles of light, optics, lasers, biology, and medicine; (2) diagnostic biophotonics including imaging, spectroscopy, and optical biosensors; (3) therapeutic applications of biophotonics including laser ablation and photodynamic therapies. Reviews and presentations of current scientific literature by students. Tours of microscopy facilities. Same as BIOE 467. 3 undergraduate hours. 3 graduate hours. Prerequisite: One of ECE 455, ECE 460, PHYS 402.\n"},
{"name": "ECE 468", "ptag": "\nOptical sensors including single element and area arrays (CCDs); optical systems including imagers, spectrometers, interferometers, and lidar; optical principles and light gathering power; electromagnetics of atomic and molecular emission and scattering with applications to the atmosphere the prime example; applications to ground and spacecraft platforms. Four laboratory sessions (4.5 hours each) arranged during term in lieu of four lectures. Same as AE 468. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 329, ECE 313.\n"},
{"name": "ECE 469", "ptag": "\nCircuits and devices used for switching power converters, solid-state motor drives, and power controllers; dc-dc, ac-dc, and dc-ac converters and applications; high-power transistors and magnetic components; design considerations including heat transfer. 2 undergraduate hours. 2 graduate hours. Prerequisite: ECE 343; credit or concurrent registration in ECE 464.\n"},
{"name": "ECE 470", "ptag": "\nFundamentals of robotics including rigid motions; homogeneous transformations; forward and inverse kinematics; velocity kinematics; motion planning; trajectory generation; sensing, vision; control. Same as AE 482 and ME 445. 4 undergraduate hours. 4 graduate hours. Prerequisite: One of MATH 225, MATH 286, MATH 415, MATH 418.\n"},
{"name": "ECE 472", "ptag": "\nTheoretical and engineering foundations of ultrasonic imaging for medical diagnostics. Conventional, Doppler, and advanced ultrasonic imaging techniques; medical applications of different ultrasonic imaging techniques; engineering problems related to characterization of ultrasonic sources and arrays, image production, image quality, the role of contrast agents in ultrasonic imaging, and system design. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 329.\n"},
{"name": "ECE 473", "ptag": "\nDevelopment of the basic theoretical concepts of acoustical systems; mechanical vibration, plane and spherical wave phenomena in fluid media, lumped and distributed resonant systems, and absorption phenomena and hearing. Same as TAM 413. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: MATH 285 or MATH 286.\n"},
{"name": "ECE 476", "ptag": "\nDevelopment of power system equivalents by phase network analysis, load flow, symmetrical components, sequence networks, fault analysis, and digital simulation. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 330.\n"},
{"name": "ECE 478", "ptag": "\nSame as CS 477. See CS 477.\n"},
{"name": "ECE 480", "ptag": "\nFundamental physical, mathematical, and computational principles governing the data acquisition and image reconstruction of magnetic resonance imaging. Same as BIOE 480. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: Recommended: ECE 310.\n"},
{"name": "ECE 481", "ptag": "\nFundamental physical properties of nanoscale systems. Nanofabrication techniques, semiconductor nanotechnology, molecular and biomolecular nanotechnology, carbon nanotechnology (nanotubes and graphene), nanowires, and nanoscale architectures and systems. 4 undergraduate hours. 4 graduate hours. Prerequisite: One of CHEM 442, CHBE 457, ME 485, MSE 401, PHYS 460.\n"},
{"name": "ECE 482", "ptag": "\nBipolar and MOS field effect transistor characteristics; VLSI fabrication techniques for MOS and bipolar circuits; calculation of circuit parameters from the process parameters; design of VLSI circuits such as logic, memories, charge-coupled devices, and A/D and D/A converters. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 342.\n"},
{"name": "ECE 483", "ptag": "\nBasic linear integrated circuit design techniques using bi-polar, JFET, and MOS technologies; operational amplifiers; wide-band feedback amplifiers; sinusoidal and relaxation oscillators; electric circuit noise; application of linear integrated circuits. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 342.\n"},
{"name": "ECE 485", "ptag": "\nIntroduction to principles, fabrication techniques, and applications of microelectromechanical systems (MEMS). In-depth analysis of sensors, actuator principles, and integrated microfabrication techniques for MEMS. Comprehensive investigation of state-of-the-art MEMS devices and systems. Same as ME 485. 3 undergraduate hours. 3 graduate hours.\n"},
{"name": "ECE 486", "ptag": "\nAnalysis and design of control systems with emphasis on modeling, state variable representation, computer solutions, modern design principles, and laboratory techniques. 4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 210.\n"},
{"name": "ECE 487", "ptag": "\nApplication of quantum mechanical concepts to electronics problems; detailed analysis of a calculable two-state laser system; incidental quantum ideas bearing on electronics. 3 undergraduate hours. 3 graduate hours. Prerequisite: PHYS 485.\n"},
{"name": "ECE 488", "ptag": "\nAdvanced semiconductor materials and devices; elementary band theory; heterostructures; transport issues; three-terminal devices; two-terminal devices; including lasers and light modulators. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 340 and ECE 350.\n"},
{"name": "ECE 489", "ptag": "\nSame as ME 446 and SE 422. See SE 422.\n"},
{"name": "ECE 490", "ptag": "\nBasic theory and methods for the solution of optimization problems; iterative techniques for unconstrained minimization; linear and nonlinear programming with engineering applications. Same as CSE 441. 3 undergraduate hours. 4 graduate hours. Prerequisite: ECE 220 and MATH 415.\n"},
{"name": "ECE 491", "ptag": "\nSame as CS 450, CSE 401 and MATH 450. See CS 450.\n"},
{"name": "ECE 492", "ptag": "\nSame as CS 420 and CSE 402. See CS 420.\n"},
{"name": "ECE 493", "ptag": "\nSame as MATH 487. See MATH 487.\n"},
{"name": "ECE 495", "ptag": "\nActive photonic devices and lightwave technology. Hands-on experience with several classes of lasers (HeNe laser, semiconductor edge emitting lasers, vertical cavity surface emitting lasers), photodetectors, and photonic systems. Familiarization with experimental optical characterization techniques and equipment. 3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 487 recommended.\n"},
{"name": "ECE 496", "ptag": "\nIndividual research project under the guidance of a faculty member: for example, mathematical analysis, laboratory experiments, computer simulations, software development, circuit design, or device fabrication. Preparation of a written research proposal, including preliminary results. 2 undergraduate hours. No graduate credit. May be repeated. ECE 496 and ECE 499 taken in sequence fulfill the Advanced Composition Requirement. Prerequisite: RHET 105; consent of instructor. This course satisfies the General Education Criteria for:Advanced Composition"},
{"name": "ECE 498", "ptag": "\nSubject offerings of new and developing areas of knowledge in electrical and computer engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. 0 to 4 undergraduate hours. 0 to 4 graduate hours. May be repeated in the same or separate terms if topics vary.\n"},
{"name": "ECE 499", "ptag": "\nCompletion of the research project begun under ECE 496. Preparation and oral presentation of a written thesis that reports the results of the project. 2 undergraduate hours. No graduate credit. To fulfill the Advanced Composition Requirement, credit must be earned for both ECE 496 and ECE 499. Prerequisite: ECE 496 and consent of instructor.This course satisfies the General Education Criteria for:Advanced Composition"},
{"name": "ECE 500", "ptag": "\nRequired of all graduate students. Approved for S/U grading only.\n"},
{"name": "ECE 508", "ptag": "\nAlgorithm techniques for enhancing the scalability of parallel software: scatter vs. gather, problem decomposition, spatial sorting and binning, privatization for reduced conflicts, tiling for data locality, regularization for improved load balance, compaction to conserve memory bandwidth, double-buffering to overlap latencies, and data layout for improved efficiency of DRAM accesses. Same as CS 508. 4 graduate hours. No professional credit. Prerequisite: ECE 408 or CS 420.\n"},
{"name": "ECE 511", "ptag": "\nAdvanced concepts in computer architecture: design, management, and modeling of memory hierarchies; stack-oriented processors; associative processors; pipelined computers; and multiple processor systems. Emphasis on hardware alternatives in detail and their relation to system performance and cost. Same as CSE 521. Prerequisite: ECE 411 or CS 433.\n"},
{"name": "ECE 512", "ptag": "\nDesign of high performance computer systems; instruction level concurrency; memory system implementation; pipelining, superscalar, and vector processing; compiler back-end code optimization; profile assisted code transformations; code generation and machine dependent code optimization; cache memory design for multiprocessors; synchronization implementation in multiprocessors; compatibility issues; technology factors; state-of-the-art commercial systems. Prerequisite: ECE 511 and CS 426.\n"},
{"name": "ECE 513", "ptag": "\nMathematical tools in a vector space framework, including: finite and infinite dimensional vector spaces, Hilbert spaces, orthogonal projections, subspace techniques, least-squares methods, matrix decomposition, conditioning and regularizations, bases and frames, the Hilbert space of random variables, random processes, iterative methods; applications in signal processing, including inverse problems, filter design, sampling, interpolation, sensor array processing, and signal and spectral estimation. Prerequisite: ECE 310, ECE 313, and MATH 415.\n"},
{"name": "ECE 515", "ptag": "\nFeedback control systems emphasizing state space techniques. Basic principles, modeling, analysis, stability, structural properties, optimization, and design to meet specifications. Same as ME 540. Prerequisite: ECE 486.\n"},
{"name": "ECE 517", "ptag": "\nDesign of nonlinear control systems based on stability considerations; Lyapunov and hyperstability approaches to analysis and design of model reference adaptive systems; identifiers, observers, and controllers for unknown plants. Prerequisite: ECE 515.\n"},
{"name": "ECE 518", "ptag": "\nSemiconductor nanotechnology from the formation and characterization of low-dimensional structures to device applications. Compound semiconductors, epitaxial growth, quantum dots, nanowires, membranes, strain effect, quantum confinement, surface states, 3D transistors, nanolasers, multijunction tandem solar cells, and nanowire thermoelectrics. Handouts are supplemented with papers from the research literature. Critical literature review assignments, research proposals in National Science Foundation format, and oral presentations are required. Prerequisites: ECE 340, ECE 444, and ECE 481.\n"},
{"name": "ECE 519", "ptag": "\nThis course teaches algorithms for verification that are applied to very large scale hardware in the chip design industry. The course teaches symbolic model checking, Binary decision diagrams (BDDs), satisfiability (SAT) based algorithms, symbolic simulation, coverage metrics for simulation, automatic assertion generation, analog circuit verification and post Silicon validation algorithms. The course teaches scalable search algorithms that can be applied to discrete and continuous space models. Same as CS 585. 4 graduate hours. No professional credit.\n"},
{"name": "ECE 520", "ptag": "\nFundamental electromagnetic theory with applications to plane waves, waveguides, cavities, antennas, and scattering; electromagnetic principles and theorems; and solution of electromagnetic boundary-value problems.\n"},
{"name": "ECE 523", "ptag": "\nSame as NPRE 527. See NPRE 527.\n"},
{"name": "ECE 524", "ptag": "\nSame as CS 563. See CS 563.\n"},
{"name": "ECE 526", "ptag": "\nTheoretical aspects of distributed algorithms, with an emphasis on formal proofs of correctness and theoretical performance analysis. Algorithms for consensus, clock synchronization, mutual exclusion, debugging of parallel programs, peer-to-peer networks, and distributed function computation; fault-tolerant distributed algorithms; distributed algorithms for wireless networks. Same as CS 539. 4 graduate hours. No professional credit. Prerequisite: One of CS 473, ECE 428, ECE 438.\n"},
{"name": "ECE 527", "ptag": "\nSystem-on-chip (SOC) design methodology and IP (intellectual property) reuse, system modeling and analysis, hardware/software co-design, behavioral synthesis, embedded software, reconfigurable computing, design verification and test, and design space exploration. Class projects focusing on current SOC design and research. Platform FPGA boards and digital cameras are provided to prototype, test, and evaluate SOC designs. Prerequisite: ECE 391 and ECE 425.\n"},
{"name": "ECE 528", "ptag": "\nNonlinear dynamics, vector fields and flows, Lyapunov stability theory, regular and singular perturbations, averaging, integral manifolds, input-output and input-to-state stability, and various design applications in control systems and robotics. Same as ME 546 and SE 520. 4 graduate hours. No professional credit. Prerequisite: ECE 515 and MATH 444 or MATH 447.\n"},
{"name": "ECE 530", "ptag": "\nFundamental techniques for the analysis of large-scale electrical systems, including methods for nonlinear and switched systems. Emphasis on the importance of the structural characteristics of such systems. Key aspects of static and dynamic analysis methods. Prerequisite: ECE 464 and ECE 476.\n"},
{"name": "ECE 531", "ptag": "\nPropagation of electromagnetic waves in general cylindrical waveguides; stationary principles; non-uniform inhomogeneously filled waveguides; mode and power orthogonality; losses in waveguides; analytical and numerical techniques; microwave integrated circuits waveguides; optical waveguides. Prerequisite: ECE 520. Recommended: MATH 556.\n"},
{"name": "ECE 532", "ptag": "\nCompound semiconductor materials and their optical properties. Diode lasers including quantum well heterostructure lasers, strained layer lasers, and quantum wire and quantum dot lasers. Current topics in diode laser development. Prerequisite: ECE 340 and PHYS 486. Recommended: ECE 455; credit or concurrent registration in ECE 536.\n"},
{"name": "ECE 534", "ptag": "\nBasic concepts of random processes; linear systems with random inputs; Markov processes; spectral analysis; Wiener and Kalman filtering; applications to systems engineering. Prerequisite: One of ECE 313, MATH 461, STAT 400.\n"},
{"name": "ECE 535", "ptag": "\nIntroductory quantum mechanics of semiconductors; energy bands; dynamics of Block electrons in static and high-frequency electric and magnetic fields; equilibrium statistics; transport theory, diffusion, drift, and thermoelectric effects; characteristics of p-n junctions, heterojunctions, and transistor devices. Same as PHYS 565. Prerequisite: Senior-level course in quantum mechanics or atomic physics.\n"},
{"name": "ECE 536", "ptag": "\nIntegrated optical and optoelectronic devices; theory of optical devices including laser sources, waveguides, photodetectors, and modulations of these devices. Prerequisite: One of ECE 455, ECE 487, PHYS 486. Recommended: ECE 488.\n"},
{"name": "ECE 537", "ptag": "\nDevelopment of an intuitive understanding of speech processing by the auditory system, in three parts. I): The theory of acoustics of speech production, introductory acoustic phonetics, inhomogeneous transmission line theory (and reflectance), room acoustics, the short-time Fourier Transform (and its inverse), and signal processing of speech (LPC, CELP, VQ). II): Psychoacoustics of speech perception, critical bands, masking (JNDs), and the physiology of the auditory pathway (cochlear modeling). III): Information theory entropy, channel capacity, the confusion matrix, state models, EM algorithms, and Bayesian networks. Presentation of classic papers on speech processing and speech perception by student groups. MATLAB (or equivalent) programming in majority of assignments. Prerequisite: ECE 310.\n"},
{"name": "ECE 539", "ptag": "\nAdvanced topics of current interest in the physics of semiconductors and solid-state devices. Prerequisite: ECE 535.\n"},
{"name": "ECE 540", "ptag": "\nBasic computational techniques for numerical analysis of electromagnetics problems, including the finite difference, finite element, and moment methods. Emphasis on the formulation of physical problems into mathematical boundary-value problems, numerical discretization of continuous problems into discrete problems, and development of rudimentary computer codes for simulation of electromagnetic fields in engineering problems using each of these techniques. Same as CSE 530. Prerequisite: CS 357; credit or concurrent registration in ECE 520.\n"},
{"name": "ECE 541", "ptag": "\nDevelopment of analytical models of computer systems and application of such models to performance evaluation: scheduling policies, paging algorithms, multiprogrammed resource management, and queuing theory. Same as CS 541. Prerequisite: One of ECE 313, MATH 461, MATH 463.\n"},
{"name": "ECE 542", "ptag": "\nAdvanced concepts in hardware and software fault tolerance: fault models, coding in computer systems, module and system level fault detection mechanism, reconfiguration techniques in multiprocessor systems and VLSI processor arrays, and software fault tolerance techniques such as recovery blocks, N-version programming, checkpointing, and recovery; survey of practical fault-tolerant systems. Same as CS 536. Prerequisite: ECE 411.\n"},
{"name": "ECE 543", "ptag": "\nAdvanced graduate course on modern probabilistic theory of adaptive and learning systems. The following topics will be covered; basics of statistical decision theory; concentration inequalities; supervised and unsupervised learning; empirical risk minimization; complexity-regularized estimation; generalization bounds for learning algorithms; VC dimension and Rademacher complexities; minimax lower bounds; online learning and optimization. Along with the general theory, the course will discuss applications of statistical learning theory to signal processing, information theory, and adaptive control. Basic prerequisites include probability and random processes, calculus, and linear algebra. Other necessary material and background will be introduced as needed. 4 graduate hours. No professional credit. Prerequisite: ECE 534 or equivalent.\n"},
{"name": "ECE 544", "ptag": "\nLectures and discussions related to advanced topics and new areas of interest in signal processing: speech, image, and multidimensional processing. May be repeated 8 hours in a term to a total of 20 hours. Credit towards a degree from multiple offerings of this course is not given if those offerings have significant overlap, as determined by the ECE department. Prerequisite: As specified each term. It is expected that each offering will have a 500-level course as prerequisite or co-requisite.\n"},
{"name": "ECE 545", "ptag": "\nAdvanced topics in acoustics including physical properties of a fluid; linear propagation phenomena; nonlinear phenomena such as radiation force, streaming, and harmonic generation; cavitation; absorption and dispersion. Prerequisite: One of ECE 473, ECE 520, TAM 518.\n"},
{"name": "ECE 546", "ptag": "\nSignal integrity aspects involved in the design of high-speed computers and high-frequency circuits; addressing the functions of limitations of interconnects for system-level integration. Topics explored include packaging structures, power and signal distribution, power level fluctuations, skin effect, parasitics, noise, packaging hierarch, multilayer wiring structures as well as the modeling and simulation of interconnects through the use of computer-aided design (CAD) and computational electromagnetics. Prerequisite: ECE 520.\n"},
{"name": "ECE 547", "ptag": "\nFundamental concepts, techniques, and directions of research in image processing: two-dimensional Fourier transform and filtering, image digitization, coding, restoration, reconstruction, analysis, and recognition. Same as CSE 543. Prerequisite: ECE 310 and ECE 313.\n"},
{"name": "ECE 548", "ptag": "\nSame as CS 548. See CS 548.\n"},
{"name": "ECE 549", "ptag": "\nInformation processing approaches to computer vision, algorithms, and architectures for artificial intelligence and robotics systems capable of vision: inference of three-dimensional properties of a scene from its images, such as distance, orientation, motion, size and shape, acquisition, and representation of spatial information for navigation and manipulation in robotics. Same as CS 543. Prerequisite: ECE 448 or CS 225.\n"},
{"name": "ECE 550", "ptag": "\nComputational approaches to robot motion planning, configuration space, algebraic decompositions, artificial potential fields, retraction, approximate decompositions, planning under uncertainty, grasp planning, and task-level planning. Same as AE 583. Prerequisite: ECE 470.\n"},
{"name": "ECE 551", "ptag": "\nBasic concept review of digital signals and systems; computer-aided digital filter design, quantization effects, decimation and interpolation, and fast algorithms for convolution and the DFT; introduction to adaptive signal processing. Prerequisite: ECE 310 and ECE 313.\n"},
{"name": "ECE 552", "ptag": "\nFormulation of circuit equations; sparse matrix algorithms for the solution of large systems, AC, DC, and transient analysis of electrical circuits; sensitivity analysis; decomposition methods. Same as CSE 532. Prerequisite: MATH 415 and ECE 210.\n"},
{"name": "ECE 553", "ptag": "\nTheoretical and algorithmic foundations of deterministic optimal control theory, including calculus of variations, maximum principle, and principle of optimality; the Linear-Quadratic-Gaussian design; differential games and H-infinity optimal control design. Prerequisite: ECE 313 and ECE 515.\n"},
{"name": "ECE 554", "ptag": "\nReliability and dynamic performance evaluation for large-scale and complex systems; building on system-theoretic modeling, analysis, and design techniques. Design methods for reliability including architecture design and filter-based fault detection and isolation. Analytical methods for optimal redundancy allocation, sensitivity analysis methods for iterative system design, and other techniques for design optimization. Mechatronic systems used in aircraft and automotive, power electronic systems, and electrical power systems are examples of applications discussed. Same as ME 544. Prerequisite: ECE 313 and ECE 515, or permission of instructor.\n"},
{"name": "ECE 555", "ptag": "\nStochastic control models; development of control laws by dynamic programming; separation of estimation and control; Kalman filtering; self-tuning regulators; dual controllers; decentralized control. Prerequisite: ECE 515 and ECE 534.\n"},
{"name": "ECE 556", "ptag": "\nCoding theory with emphasis on the algebraic theory of cyclic codes using finite field arithmetic, decoding of BCH and RS codes, finite field Fourier transform and algebraic geometry codes, convolutional codes, and trellis decoding algorithms. Prerequisite: MATH 417.\n"},
{"name": "ECE 557", "ptag": "\nGraduate course on mathematical theory of control and optimization, with a focus on geometric and topological methods. The following topics will be covered: introduction to the basics of differential geometric, Riemannian geometry, algebraic topology and Lie group theory. Control systems on manifolds. Controllability and observability of nonlinear systems. Optimization on manifolds and Lie groups and their applications in signal processing and learning. Control of non-holonomic systems and mechanical systems, rigid body dynamics. Optimal control on manifolds and Lie groups. Feedback linearization and feedback invariants. Introduction to quantum control. 4 graduate hours. No professional credit. Prerequisite: ECE 515 or equivalent is required. A course on state-space control theory, multivariable calculus, linear algebra and overall mathematical maturity are recommended.\n"},
{"name": "ECE 558", "ptag": "\nMultidimensional signals, convolution, transforms, sampling, and interpolation; design of two-dimensional digital filters; sensor array processing and range-doppler imaging; applications to synthetic aperture radar, optics, tomography, radio astronomy, and beam-forming sonar; image estimation from partial data. Prerequisite: ECE 310 and ECE 313.\n"},
{"name": "ECE 559", "ptag": "\nLectures and discussion related to advanced topics and new areas of interest in the theory of communication systems: information theory, coding theory, and communication network theory. May be repeated in the same term, if topics vary, to a maximum of 12 graduate hours; may be repeated in separate terms, if topics vary, to a maximum of 16 graduate hours. Credit toward a degree from multiple offerings of this course is not given if those offerings have significant overlap, as determined by the ECE department. Prerequisite: As specified each term. (It is expected that each offering will have a 500-level course as a prerequisite or co-requisite.).\n"},
{"name": "ECE 560", "ptag": "\nBasic concepts in digital signal processing, VLSI design methodologies, VLSI DSP building blocks; algorithm transformation and mapping techniques, high-speed, low-power transforms, applications to digital filtering; basics of finite-field arithmetic, forward-error correction algorithms, and architectures; DSP implementation platforms, programmable DSPs, media processors, FPGAs, ASICs, case studies of multimedia communications systems, video codecs, xDSL, and cable modems. Homework and a term project apply these concepts in the design of VLSI architectures for digital signal processing and communication systems. Prerequisite: ECE 310.\n"},
{"name": "ECE 561", "ptag": "\nDetection and estimation theory, with applications to communication, control, and radar systems; decision-theory concepts and optimum-receiver principles; detection of random signals in noise, coherent and noncoherent detection; parameter estimation, linear and nonlinear estimation, and filtering. Prerequisite: ECE 534.\n"},
{"name": "ECE 562", "ptag": "\nDigital communication systems modulation, demodulation, signal space methods, channel models, bit error rate, spectral occupancy, synchronization, equalization, trellis-coded modulation, wireless channels, multiantenna systems, spread spectrum, and orthogonal frequency modulation. 4 graduate hours. No professional credit. Prerequisite: ECE 461 or ECE 459.\n"},
{"name": "ECE 563", "ptag": "\nMathematical models for channels and sources; entropy, information, data compression, channel capacity, Shannon's theorems, and rate-distortion theory. Prerequisite: One of ECE 534, MATH 464, MATH 564.\n"},
{"name": "ECE 564", "ptag": "\nCurrent research topics in modern light microscopy: optics principles (statistical optics, Gaussian optics, elastic light scattering, dynamic light scattering); traditional microscopy (bright field, dark field, DIC, phase contract, confocal, epi-fluorescence, confocal fluorescence); current research topics (multiphoton, CARS, STED, FRET, FIONA, STORM, PALM, quantitative phase). Prerequisite: One of ECE 460, MSE 405, PHYS 402.\n"},
{"name": "ECE 566", "ptag": "\nComputational inference and machine learning have seen a surge of interest in the last 15 years, motivated by applications as diverse as computer vision, speech recognition, analysis of networks and distributed systems, big-data analytics, large-scale computer simulations, and indexing and searching of very large databases. This course introduces the mathematical and computational methods that enable such applications. Topics include computational methods for statistical inference, sparsity analysis, approximate inference and search, and fast optimization. 4 graduate hours. No professional credit. Prerequisite: ECE 490, ECE 534.\n"},
{"name": "ECE 567", "ptag": "\nPerformance analysis and design of multiple-user communication systems; emphasis on rigorous formulation and analytical and computational methods; includes queuing networks, decentralized minimum delay routing, and dynamic network flow control. Prerequisite: CS 438; one of ECE 534, MATH 464, MATH 564.\n"},
{"name": "ECE 568", "ptag": "\nFundamental electrical and mechanical laws for derivation of machine models; simplifying transformations of variables in electrical machines; power electronics for motor control; time-scale separation; feedback linearization and nonlinear control as applied to electrical machines. Typical electromechanical applications in actuators, robotics, and variable speed drives. Prerequisite: ECE 431 and ECE 515.\n"},
{"name": "ECE 569", "ptag": "\nPhysical optics, solution of linear inverse problems, and computed imaging. Forward problems in diffraction, asymptotics, ray propagation, x-ray projections, scattering, sources, optical coherence tomography, and near-field optics. Solution of associated inverse problems including back-propagation, back-projection, Radon transforms (x-ray CT), inverse scattering, source localization, interferometric synthetic aperture microscopy, and near-field tomography. Special topics as time permits. Prerequisite: ECE 460.\n"},
{"name": "ECE 570", "ptag": "\nLight propagation in anisotropic crystals; second- and third-order nonlinear susceptibility and electro-optic effect; discussion of the relationship of these effects along with such applications as light modulation, harmonic generation, and optical parametric amplification and oscillation. Prerequisite: ECE 520.\n"},
{"name": "ECE 571", "ptag": "\nElectromagnetic waves in layered media; plane wave expansion of electromagnetic point source field; Sommerfeld integrals; transient response; WKB method with asymptotic matching; scattering by junction discontinuity; surface integral equation; volume integral equation; inverse problems. Prerequisite: MATH 446; ECE 520 or PHYS 505.\n"},
{"name": "ECE 572", "ptag": "\nTheoretical approach to quantum mechanics and atomic physics, with many applications in spin resonance and modern maser theory. Prerequisite: PHYS 485 recommended.\n"},
{"name": "ECE 573", "ptag": "\nEnergy control center functions, state estimation and steady state security assessment techniques, economic dispatch, optimal power flow, automatic generation control, and dynamic equivalents. Prerequisite: ECE 476; credit or concurrent registration in ECE 530.\n"},
{"name": "ECE 574", "ptag": "\nNanoscale interaction between light and semiconductors, metals, or composites; plasmonics, cavity electrodynamics, polarition cavity condensation, sub-wavelength structures, metamaterials, and applications. Prerequisite: ECE 455 or ECE 572; ECE 487 or PHYS 486.\n"},
{"name": "ECE 576", "ptag": "\nDetailed modeling of the synchronous machine and its controls, such as excitation system and turbine-governor dynamics; time-scales and reduced order models; non-linear and linear multi-machine models; stability analysis using energy functions; power system stabilizers. Prerequisite: ECE 476; credit or concurrent registration in ECE 530.\n"},
{"name": "ECE 577", "ptag": "\nSelected topics from recent engineering literature on antennas supplemented by advanced topics in electromagnetic theory needed for comprehension; current techniques for analysis of wire, slot, horn, frequency independent, quasi-optical, and array antennas. Prerequisite: ECE 520.\n"},
{"name": "ECE 579", "ptag": "\nSame as CS 579. See CS 579.\n"},
{"name": "ECE 580", "ptag": "\nNormed, Banach, and Hilbert spaces; applications of the projection theorem and the Hahn-Banach Theorem to problems of minimum norm, least squares estimation, mathematical programming, and optimal control; the Kuhn-Tucker Theorem and Pontryagin's maximum principle; iterative methods. Prerequisite: MATH 415 or MATH 482; MATH 447.\n"},
{"name": "ECE 581", "ptag": "\nAdvanced topics in modern analog IC design. Emphasis on CMOS building blocks and circuit techniques as a result of fabrication technology advancement. Noise in linear analog circuits; linear feedback theory and stability; harmonic distortion in weakly nonlinear circuits; switched-capacitor circuit technique and realization; Nyquist-rate and oversampled data converters. Extensive computer simulations required in both homework and final project. Prerequisite: ECE 310 and ECE 483.\n"},
{"name": "ECE 582", "ptag": "\nBasic physical design requirements for VLSI; performance-oriented formulation and optimization of chip partitioning, module placement and interconnection; optimized design and layout of on-chip modules; circuit extraction; high-speed VLSI circuits; yield and reliability analysis; advanced VLSI packaging and parametric testing. Prerequisite: ECE 425 or ECE 482.\n"},
{"name": "ECE 584", "ptag": "\nExamines formal analysis an synthesis approaches for discrete, continuous, and hybrid models of computing systems and their physical environment. Introduces timed and hybrid automata models. Analysis techniques including model checking, Hoare-style deduction, and abstractions for safety and stability, and controller synthesis strategies with applications in distributed robotics, automobile system, traffic control, and real-time systems. Same as CS 584. 4 graduate hours. No professional credit. Prerequisite: CS 476 or CS 477.\n"},
{"name": "ECE 585", "ptag": "\nTechniques for characterizing gate oxide and interface properties and reliability, I-V models for circuit simulation, design for control of short channel effects, silicon-on-insulator, and new device structures. Prerequisite: ECE 441.\n"},
{"name": "ECE 586", "ptag": "\nLectures and discussions related to advanced topics and new areas of interest in decision and control theory: hybrid, sampled-data, and fault tolerant systems; control over networks; vision-based control; system estimation and identification; dynamic games. May be repeated up to 12 hours within a term, and up to 20 hours total for the course. Credit towards a degree from multiple offerings of this course is not given if those offerings have significant overlap, as determined by the ECE department. Prerequisite: As specified each term. It is expected that each offering will have a 500-level course as prerequisite or co-requisite.\n"},
{"name": "ECE 588", "ptag": "\nTechniques in electricity resource planning including methodologies for reliability evaluation and assessment, production costing, marginal costing, supply-side and demand-side planning, integrated planning, and planning under competition. Prerequisite: MATH 415, ECE 313, and ECE 476.\n"},
{"name": "ECE 590", "ptag": "\nLectures and discussions on current research and literature on advanced topics in electrical engineering. Approved for S/U grading only. May be repeated. Prerequisite: Consent of instructor.\n"},
{"name": "ECE 594", "ptag": "\nMathematical models of linguistic structure and their implementation in computational algorithms used in automatic speech understanding and speech synthesis. Statistical and automata-theoretic techniques are studied allowing a quantitative description of acoustic-phonetics, phonology, phonotactics, lexicons, syntax, and semantics. The methods are used to build components of a speech understanding system. For 4 hours credit, an extended project is required. Prerequisite: ECE 537.\n"},
{"name": "ECE 596", "ptag": "\nIndividual or team projects in electrical and computer engineering emphasizing advanced engineering analysis and design. May be repeated to a maximum of 16 hours.\n"},
{"name": "ECE 597", "ptag": "\nIndividual projects. Approved written application to department as specified by department or instructor is required. May be repeated. Prerequisite: Consent of instructor.\n"},
{"name": "ECE 598", "ptag": "\nSubject offerings of new and developing areas of knowledge in electrical and computer engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. May be repeated in the same or separate terms if topics vary.\n"},
{"name": "ECE 599", "ptag": "\nApproved for S/U grading only. May be repeated.\n"},
